Constructs a default instance of diagram settings.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public AnalysisDisplayDiagramSettings()
  Visual Basic
Public Sub New
  Visual C++
public:
AnalysisDisplayDiagramSettings()
 See Also
  AnalysisDisplayDiagramSettings Class
  AnalysisDisplayDiagramSettings Overload
  Autodesk.Revit.DB.Analysis Namespace